/**
 * Auth: enixlee
 * Date: 2017/6/19
 * Description: PMConstantsRegExp
 * 规则：
 * 验证数字：^[0-9]*$
 * 验证n位的数字：^\d{n}$
 * 验证至少n位数字：^\d{n,}$
 * 验证m-n位的数字：^\d{m,n}$
 * 验证零和非零开头的数字：^(0|[1-9][0-9]*)$
 * 验证有两位小数的正实数：^[0-9]+(.[0-9]{2})?$
 * 验证有1-3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$
 * 验证非零的正整数：^\+?[1-9][0-9]*$
 * 验证非零的负整数：^\-[1-9][0-9]*$
 * 验证非负整数（正整数 + 0） ^\d+$
 * 验证非正整数（负整数 + 0） ^((-\d+)|(0+))$
 * 验证长度为3的字符：^.{3}$
 * 验证由26个英文字母组成的字符串：^[A-Za-z]+$
 * 验证由26个大写英文字母组成的字符串：^[A-Z]+$
 * 验证由26个小写英文字母组成的字符串：^[a-z]+$
 * 验证由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$
 * 验证由数字、26个英文字母或者下划线组成的字符串：^\w+$
 * 验证用户密码:^[a-zA-Z]\w{5,17}$ 正确格式为：以字母开头，长度在6-18之间，只能包含字符、数字和下划线。
 * 验证是否含有 ^%&',;=?$\" 等字符：[^%&',;=?$\x22]+
 * 验证汉字：^[\u4e00-\u9fa5],{0,}$
 * 验证Email地址：/^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/
 * 验证InternetURL：^http://([\w-]+\.)+[\w-]+(/[\w-./?%&=]*)?$ ；^[a-zA-z]+://(w+(-w+)*)(.(w+(-w+)*))*(?S*)?$
 * 验证电话号码：^(\(\d{3,4}\)|\d{3,4}-)?\d{7,8}$：--正确格式为：XXXX-XXXXXXX，XXXX-XXXXXXXX，XXX-XXXXXXX，XXX-XXXXXXXX，XXXXXXX，XXXXXXXX。
 * 验证身份证号（15位或18位数字）：^\d{15}|\d{}18$
 * 验证一年的12个月：^(0?[1-9]|1[0-2])$ 正确格式为：“01”-“09”和“1”“12”
 * 验证一个月的31天：^((0?[1-9])|((1|2)[0-9])|30|31)$ 正确格式为：01、09和1、31。
 * 整数：^-?\d+$
 * 非负浮点数（正浮点数 + 0）：^\d+(\.\d+)?$
 * 正浮点数 ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$
 * 非正浮点数（负浮点数 + 0） ^((-\d+(\.\d+)?)|(0+(\.0+)?))$
 * 负浮点数 ^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$
 * 浮点数 ^(-?\d+)(\.\d+)?$
 */
/**
 * 2-10个汉字
 * @type {RegExp}
 */
export const REGEXP_CHINESE_LENGTH_2_10 = /^[\u4e00-\u9fa5]{2,10}$/;
/**
 * 身份证
 * @type {RegExp}
 */
export const REGEXP_ID_NO = /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/;
/**
 * 6-12位数字字母，无符号
 * @type {string}
 */
export const REGEXP_NUMBER_AND_CHAR_LENGTH_6_12 = /^\w{6,12}$/;
/**
 * 1-11位数字
 * @type {RegExp}
 */
export const REGEXP_NUMBER_LENGTH_1_11 = /^\d{1,11}$/;

/**
 * 是否是纯汉字字符串
 * @type {RegExp}
 */
export const REGEXP_IS_CHINESE_STRING = /^[\u4e00-\u9fa5]+$/;

/**
 * 是否含有汉字
 * @type {RegExp}
 */
export const REGEXP_CONTAIN_CHINESE = /.*[\u4e00-\u9fa5]+.*$/;

/**
 * 数字开头包含数字和字母的字符串
 * @type {RegExp}
 */
export const REGEXP_START_WITH_NUMBER_AND_HAS_NUM_OR_CHAR = /^[0-9][a-zA-Z0-9]*$/;

/**
 * 至少1位的数字
 * @type {RegExp}
 */
export const REGEXP_NUMBER_LENGTH_LEAST_1 = /^\d{1,}$/;

/**
 * 6位数字
 * @type {RegExp}
 */
export const REGEXP_SIX_NUMBER = /^\w{6,6}$/;

/**
 * 数字字母下划线及其它字符(6-16)
 */
export const REG_CHAR_NUMBER_LINE = /^[A-Za-z0-9$!~&=#@_+%*.]{6,16}$/;

/**
 * 非负整数，大于等于0
 * @type {RegExp}
 */
export const NATURAL_INTEGER = /^\+?[0-9][0-9]*$/;
/**
 * 验证码规则
 * @type {RegExp}
 */
export const VERIFY_CODE_REG = /^[A-Za-z0-9]{4,4}$/;
/**
 * 卡号输入规则
 */
export const PREPAIDCARD_NO = /^\+?[8-9][0-9\s]{0,23}$/;
